### Exporting Data Into Files

After cleaning and transforming the data, we may want to export it back into a csv file or another file. Here is how to go about it below.

In [1]:
# Here is how to import pandas in your project
import pandas as pd;

In [2]:
old_df = pd.DataFrame({'name': ['Alice', 'Janvier', 'Naomie', 'Kate', 'Bob', 'Jeff', 'Jack'], 'age': [25, 30, 11, 25, 40, 25, None], 'Sex': ['female', 'male', 'female', 'female', 'male', 'male', 'male'], 'city': ['Rockville', 'Germantown', 'Denver', 'Rome', None, 'Harrisonburg', None]})
old_df

      name   age     Sex          city
0    Alice  25.0  female     Rockville
1  Janvier  30.0    male    Germantown
2   Naomie  11.0  female        Denver
3     Kate  25.0  female          Rome
4      Bob  40.0    male          None
5     Jeff  25.0    male  Harrisonburg
6     Jack   NaN    male          None

In [3]:
# Clean and transform data
new_df = pd.get_dummies(old_df, columns=['Sex'], drop_first=True)
new_df['city'].fillna(value='Paris', inplace=True)
meanAge = new_df['age'].mean()
new_df['age'].fillna(meanAge, inplace=True)
new_df

      name   age          city  Sex_male
0    Alice  25.0     Rockville     False
1  Janvier  30.0    Germantown      True
2   Naomie  11.0        Denver     False
3     Kate  25.0          Rome     False
4      Bob  40.0         Paris      True
5     Jeff  25.0  Harrisonburg      True
6     Jack  26.0         Paris      True

In [4]:
# To Create a new csv file of the new data with the given name
new_df.to_csv('output_new_df.csv')

In [5]:
# Removing index from being stored in the new file
new_df.to_csv('output_new_df.csv', index=False)

In [6]:
# To Remove header from being stored as well (Not recommended)
#new_df.to_csv('output_new_df_2.csv', index=False, header=None)